Revit 2024 API
UnitTypeId.JoulesPerKilogramDegreeCelsius Property
 Joules per kilogram degree Celsius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId JoulesPerKilogramDegreeCelsius { get; }
Visual Basic
Public Shared ReadOnly Property JoulesPerKilogramDegreeCelsius As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ JoulesPerKilogramDegreeCelsius {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace